# Removing Dateless items

In [1]:
import pandas as pd
import datetime
import itertools

In [2]:
dates =pd.read_table("cit-HepPh-dates.txt", header = None)
dates.columns =['id1', 'date']

In [3]:
raw = pd.read_table("Cit-HepPh.txt", header = None)

In [4]:
dataset =set(raw.iloc[:,1].tolist()+raw.iloc[:,0].tolist())

In [5]:
dateset =set(dates.iloc[:,0])

In [6]:
uniq = list(dataset & dateset)

In [7]:
isuniq = raw.isin(uniq)

In [8]:
data = raw[isuniq.iloc[:,1] & isuniq.iloc[:,0]]
data.columns =['id1', 'id2']

In [9]:
data.shape

(347268, 2)

In [10]:
raw.shape

(421578, 2)

In [11]:
data = data.merge(dates, on="id1")

In [12]:
data['date'] = pd.to_datetime(data['date'])
data  = data.iloc[data['date'].argsort(),:]

In [13]:
data = data.reset_index()
del data['index']

# Sample Creation

In [32]:
len(set(data.id1))

28201

In [33]:
trainingsize= 10000
for i in range(data.shape[0]):
    if len(set(data['id1'].loc[0:i]))==trainingsize:
        print(i)
        train_end = i
        break
        
validationsize = 100
for i in range(data.shape[0]):
    if len(set(data['id1'].loc[train_end:i]))==validationsize:
        print(i)
        val_end = i
        break


testsize = 100
for i in range(data.shape[0]):
    if len(set(data['id1'].loc[val_end:i]))==validationsize:
        print(i)
        test_end = i
        break
        
        
#manual check, change  train end to 75052(-3)
#manual check, change val end to 76192(+48)
# change test end to  77395(+50)

75055
76144
77345

In [14]:
train_end = 75055
val_end = 76144
test_end = 77345

train_end_new = train_end-3
val_end_new = val_end +48
test_end_new = test_end +50

In [15]:
train = data.loc[0:train_end_new]

train_set =set(train['id1'].tolist()+train['id2'].tolist())
dictionary =dict(zip(train_set,range(1,len(train_set)+1)))
d = pd.Series(dictionary, name = "node")
d.index.name = "id"
d = d.reset_index()

train =train.merge(d,left_on ='id1', right_on = 'id')
train =train.merge(d, left_on ='id2', right_on = 'id')
del train['id_x']
del train['id_y']
train = train.iloc[train['date'].argsort(),:]

In [16]:
train.head()

         id1      id2       date  node_x  node_y
0    9203210  9801208 1992-03-15    9861   10083
41   9203210  9801209 1992-03-15    9861   10084
72   9203222  9908362 1992-03-27    9873    8909
73   9204229  9908362 1992-04-22   10073    8909
115  9205220  9506358 1992-05-13   10355    3210

In [17]:
train.tail()

           id1      id2       date  node_x  node_y
72187  9706416  9601291 1997-06-19    6318     184
40869  9706423  9501384 1997-06-19    6324   10868
45537  9706417  9503486 1997-06-19    6319     630
71253  9706412  9608460 1997-06-19    6314    6585
75052  9706427  9610516 1997-06-19    6328    9307

In [18]:
val = data.loc[train_end_new+1:val_end_new]

val_set =set(val['id1'].tolist()+val['id2'].tolist())
dictionary =dict(zip(val_set,range(1,len(val_set)+1)))
d = pd.Series(dictionary, name = "node")
d.index.name = "id"
d = d.reset_index()

val =val.merge(d,left_on ='id1', right_on = 'id')
val =val.merge(d, left_on ='id2', right_on = 'id')
del val['id_x']
del val['id_y']
val = val.iloc[val['date'].argsort(),:]

In [19]:
val.head()

         id1      id2       date  node_x  node_y
0    9706438  9408384 1997-06-20     466     981
136  9706431  9504215 1997-06-20     458     805
137  9706431  9602300 1997-06-20     458     699
138  9706431  9603351 1997-06-20     458     148
139  9706431  9303236 1997-06-20     458     659

In [20]:
val.tail()

          id1      id2       date  node_x  node_y
1066  9706522  9704335 1997-06-27     548     429
1065  9706522  9407347 1997-06-27     548     404
1064  9706522  9509225 1997-06-27     548     196
1075  9706530  9511387 1997-06-27     556     237
1139  9706527  9706235 1997-06-27     553     335

In [21]:
test = data.loc[val_end_new+1:test_end_new]

test_set =set(test['id1'].tolist()+test['id2'].tolist())
dictionary =dict(zip(test_set,range(1,len(test_set)+1)))
d = pd.Series(dictionary, name = "node")
d.index.name = "id"
d = d.reset_index()

test =test.merge(d,left_on ='id1', right_on = 'id')
test =test.merge(d, left_on ='id2', right_on = 'id')
del test['id_x']
del test['id_y']
test = test.iloc[test['date'].argsort(),:]

In [22]:
test.head()

        id1      id2       date  node_x  node_y
0   9706536  9303255 1997-06-28     521     634
34  9706534  9705290 1997-06-28     519     959
35  9706534  9705318 1997-06-28     519     979
36  9706534  9605367 1997-06-28     519     133
37  9706534  9607472 1997-06-28     519     167

In [23]:
test.tail()

          id1      id2       date  node_x  node_y
1042  9707273  9610431 1997-07-07     921     616
1043  9707273  9608441 1997-07-07     921     658
1044  9707273  9606423 1997-07-07     921     682
994   9707259  9705304 1997-07-07     908     969
1202  9707268  9612290 1997-07-07     917     493

In [24]:
train.to_csv('training.csv',index  = False)
val.to_csv('validation.csv',index  = False)
test.to_csv('test.csv',index  = False)